-- phpMyAdmin SQL Dump
-- version 4.8.4
-- https://www.phpmyadmin.net/
--
-- 主機: 127.0.0.1
-- 產生時間： 2019 年 03 月 15 日 09:39
-- 伺服器版本: 10.1.37-MariaDB
-- PHP 版本： 7.1.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `the_wheel`
--

-- --------------------------------------------------------

--
-- 資料表結構 `course`
--

CREATE TABLE `course` (
  `c_sid` int(11) NOT NULL,
  `c_name` varchar(255) CHARACTER SET utf8 NOT NULL COMMENT '課程名稱',
  `c_instructor` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '課程教練',
  `c_intro` text CHARACTER SET utf8 NOT NULL COMMENT '課程内容',
  `c_photo` varchar(255) CHARACTER SET utf8 NOT NULL COMMENT '照片',
  `c_current` int(11) NOT NULL COMMENT '目前集資金額',
  `c_target` int(11) NOT NULL COMMENT '目標集資金額',
  `c_deadline` datetime NOT NULL COMMENT '集資截止日',
  `c_donate` int(11) NOT NULL COMMENT '集資金額：$___'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- --------------------------------------------------------

--
-- 資料表結構 `e_list`
--

CREATE TABLE `e_list` (
  `e_sid` int(11) NOT NULL,
  `e_name` varchar(255) COLLATE utf8_bin NOT NULL,
  `e_leader` varchar(255) COLLATE utf8_bin NOT NULL,
  `e_depart` varchar(255) COLLATE utf8_bin NOT NULL,
  `e_arrive` varchar(255) COLLATE utf8_bin NOT NULL,
  `e_date` varchar(255) COLLATE utf8_bin NOT NULL,
  `e_endTime` varchar(255) COLLATE utf8_bin NOT NULL,
  `e_via` varchar(255) COLLATE utf8_bin NOT NULL,
  `e_current` varchar(255) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 資料表的匯出資料 `e_list`
--

INSERT INTO `e_list` (`e_sid`, `e_name`, `e_leader`, `e_depart`, `e_arrive`, `e_date`, `e_endTime`, `e_via`, `e_current`) VALUES
(2, '北宜單車', '蔡承恩', '景安', '宜蘭', '2019/03/15 10:00', '2019/03/16 12:00', '坪林茶業博物', '10'),
(3, '北基單車行', '蔡承恩', '大安捷運站', '基隆火車站', '2019/03/17 10:00', '2019/03/17 15:00', '百福車站', '20'),
(4, '北竹單車', '廖政宇', '景安捷', '新竹火', '2019/03/19 10:00', '2019/03/21 12:00', '員樹林', '15'),
(5, '北竹單車行', '廖政宇', '大安捷運站', '新竹火車站', '2019/03/19 10:00\r\n', '2019/03/21 12:00', '員樹林', '15'),
(6, '北桃單車行', '王竣麟', '大安捷運', '桃園火', '2019/03/22 10:00', '2019/03/22 17:00', '龍鳳公園', '20'),
(7, '北桃單車行', '王竣麟', '大安捷運站', '桃園火車站', '2019/03/22 10:00', '2019/03/22 17:00', '龍鳳公園', '20'),
(8, '高南單車行', '張皓涵', '高雄火車站', '台南火車站', '2019/03/24 10:00', '2019/03/25 12:00', '湖內國中', '13'),
(9, '高南單車行', '張皓涵', '高雄火車站', '台南火車站', '2019/03/24 10:00', '2019/03/25 12:00', '湖內國中', '13'),
(10, '高屏單車行', '田仲展', '高雄火車站', '屏東火車站', '2019/03/27 10:00', '2019/03/27 15:00', '萬丹', '30'),
(11, '高屏單車行', '田仲展', '高雄火車站', '屏東火車站', '2019/03/27 10:00', '2019/03/27 15:00', '萬丹', '30'),
(12, '墾丁單車行', 'ivi', '屏東火車', '墾丁大街', '2019/03/28 10:00', '2019/03/30 12:00', '楓港', '40'),
(13, '墾丁單車行', 'ivi', '屏東火車站', '墾丁大街', '2019/03/28 10:00', '2019/03/30 12:00', '楓港', '40'),
(14, '淡水單車行', '王三三', '大安捷運', '淡水捷運', '2019/03/31 09:00', '2019/03/31 11:00', '無', '10'),
(15, '淡水單車行', '王三三', '大安捷運', '宜蘭', '2019/03/15 09:00', '2019/03/31 11:00', '坪林茶業博物', '2'),
(16, '淡水單車行', '王三三', '大安捷運', '淡水捷運', '2019/03/15 09:00', '2019/03/31 11:00', '台北', '10'),
(17, '北宜單車', '王三三', '屏東火車', '淡水捷運', '2019/03/31 09:00', '2019/03/31 11:00', '萬巒', '44');

-- --------------------------------------------------------

--
-- 資料表結構 `member`
--

CREATE TABLE `member` (
  `m_sid` int(11) NOT NULL,
  `m_name` varchar(255) NOT NULL,
  `m_mobile` varchar(255) NOT NULL,
  `m_email` varchar(255) NOT NULL,
  `m_password` varchar(255) NOT NULL,
  `m_address` varchar(255) NOT NULL,
  `m_photo` varchar(255) NOT NULL,
  `m_birthday` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- 資料表結構 `prouduct`
--

CREATE TABLE `prouduct` (
  `p_sid` int(11) NOT NULL COMMENT '商品流水號',
  `p_photo` varchar(255) NOT NULL COMMENT '商品照片',
  `p_name` varchar(255) NOT NULL COMMENT '商品名稱',
  `quantity` varchar(255) NOT NULL COMMENT '數量',
  `p_description` varchar(255) NOT NULL COMMENT '說明',
  `p_price` varchar(255) NOT NULL COMMENT '價格',
  `p_genre` varchar(255) NOT NULL COMMENT '商品類別',
  `p_genre2` varchar(255) NOT NULL COMMENT '商品部件',
  `p_brand` varchar(255) NOT NULL COMMENT '品牌',
  `p_color` varchar(255) NOT NULL COMMENT '顏色',
  `p_size` varchar(255) NOT NULL COMMENT '尺寸'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `prouduct`
--

INSERT INTO `prouduct` (`p_sid`, `p_photo`, `p_name`, `quantity`, `p_description`, `p_price`, `p_genre`, `p_genre2`, `p_brand`, `p_color`, `p_size`) VALUES
(1, '照片', '捷安特公路車', '1', '好車一台', '1000', '公路車', '全車', '捷安特', '藍色', '20吋'),
(31, '', '', '', '12', '', 'Choose...', '', '', '', ''),
(33, '照片', '捷安特公路車', '1', '好車一台', '1000', '公路車', '全車', '捷安特', '藍色', '20吋'),
(34, '照片', '捷安特公路車', '1', '好車一台', '1000', '公路車', '全車', '捷安特', '藍色', '20吋');

-- --------------------------------------------------------

--
-- 資料表結構 `route`
--

CREATE TABLE `route` (
  `r_sid` int(11) NOT NULL,
  `r_name` varchar(255) COLLATE utf8_bin NOT NULL,
  `r_img` varchar(255) COLLATE utf8_bin NOT NULL,
  `m_sid` varchar(255) COLLATE utf8_bin NOT NULL,
  `r_intro` text COLLATE utf8_bin NOT NULL,
  `r_time` time NOT NULL,
  `r_tag` varchar(255) COLLATE utf8_bin NOT NULL,
  `r_country` varchar(255) COLLATE utf8_bin NOT NULL,
  `r_area` varchar(255) COLLATE utf8_bin NOT NULL,
  `r_depart` varchar(255) COLLATE utf8_bin NOT NULL,
  `r_arrive` varchar(255) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 資料表的匯出資料 `route`
--

INSERT INTO `route` (`r_sid`, `r_name`, `r_img`, `m_sid`, `r_intro`, `r_time`, `r_tag`, `r_country`, `r_area`, `r_depart`, `r_arrive`) VALUES
(1, '臺北市到淡水0', '', '0', '這一條開心的路線0', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(2, '臺北市到淡水1', '', '1', '這一條開心的路線1', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(3, '臺北市到淡水2', '', '2', '這一條開心的路線2', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(4, '臺北市到淡水3', '', '3', '這一條開心的路線3', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(5, '臺北市到淡水4', '', '4', '這一條開心的路線4', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(6, '臺北市到淡水5', '', '5', '這一條開心的路線5', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(7, '臺北市到淡水6', '', '6', '這一條開心的路線6', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(8, '臺北市到淡水7', '', '7', '這一條開心的路線7', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(9, '臺北市到淡水8', '', '8', '這一條開心的路線8', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(10, '臺北市到淡水9', '', '9', '這一條開心的路線9', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(11, '臺北市到淡水10', '', '10', '這一條開心的路線10', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(12, '臺北市到淡水11', '', '11', '這一條開心的路線11', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(13, '臺北市到淡水12', '', '12', '這一條開心的路線12', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(14, '臺北市到淡水13', '', '13', '這一條開心的路線13', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(15, '臺北市到淡水14', '', '14', '這一條開心的路線14', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(16, '臺北市到淡水15', '', '15', '這一條開心的路線15', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(17, '臺北市到淡水16', '', '16', '這一條開心的路線16', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(18, '臺北市到淡水17', '', '17', '這一條開心的路線17', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(19, '臺北市到淡水18', '', '18', '這一條開心的路線18', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(20, '臺北市到淡水19', '', '19', '這一條開心的路線19', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(21, '臺北市到淡水20', '', '20', '這一條開心的路線20', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(22, '臺北市到淡水21', '', '21', '這一條開心的路線21', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(23, '臺北市到淡水22', '', '22', '這一條開心的路線22', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(24, '臺北市到淡水23', '', '23', '這一條開心的路線23', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(25, '臺北市到淡水24', '', '24', '這一條開心的路線24', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(26, '臺北市到淡水25', '', '25', '這一條開心的路線25', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(27, '臺北市到淡水26', '', '26', '這一條開心的路線26', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(28, '臺北市到淡水27', '', '27', '這一條開心的路線27', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(29, '臺北市到淡水28', '', '28', '這一條開心的路線28', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(30, '臺北市到淡水29', '', '29', '這一條開心的路線29', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(31, '臺北市到淡水30', '', '30', '這一條開心的路線30', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(32, '臺北市到淡水31', '', '31', '這一條開心的路線31', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(33, '臺北市到淡水32', '', '32', '這一條開心的路線32', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(34, '臺北市到淡水33', '', '33', '這一條開心的路線33', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(35, '臺北市到淡水34', '', '34', '這一條開心的路線34', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(36, '臺北市到淡水35', '', '35', '這一條開心的路線35', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(37, '臺北市到淡水36', '', '36', '這一條開心的路線36', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(38, '臺北市到淡水37', '', '37', '這一條開心的路線37', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(39, '臺北市到淡水38', '', '38', '這一條開心的路線38', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(40, '臺北市到淡水39', '', '39', '這一條開心的路線39', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(41, '臺北市到淡水40', '', '40', '這一條開心的路線40', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(42, '臺北市到淡水41', '', '41', '這一條開心的路線41', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(43, '臺北市到淡水42', '', '42', '這一條開心的路線42', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(44, '臺北市到淡水43', '', '43', '這一條開心的路線43', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(45, '臺北市到淡水44', '', '44', '這一條開心的路線44', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(46, '臺北市到淡水45', '', '45', '這一條開心的路線45', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(47, '臺北市到淡水46', '', '46', '這一條開心的路線46', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(48, '臺北市到淡水47', '', '47', '這一條開心的路線47', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(49, '臺北市到淡水48', '', '48', '這一條開心的路線48', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(50, '臺北市到淡水49', '', '49', '這一條開心的路線49', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(51, '臺北市到淡水50', '', '50', '這一條開心的路線50', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(52, '臺北市到淡水51', '', '51', '這一條開心的路線51', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(53, '臺北市到淡水52', '', '52', '這一條開心的路線52', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(54, '臺北市到淡水53', '', '53', '這一條開心的路線53', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(55, '臺北市到淡水54', '', '54', '這一條開心的路線54', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(56, '臺北市到淡水55', '', '55', '這一條開心的路線55', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(57, '臺北市到淡水56', '', '56', '這一條開心的路線56', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(58, '臺北市到淡水57', '', '57', '這一條開心的路線57', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(59, '臺北市到淡水58', '', '58', '這一條開心的路線58', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(60, '臺北市到淡水59', '', '59', '這一條開心的路線59', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(61, '臺北市到淡水60', '', '60', '這一條開心的路線60', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(62, '臺北市到淡水61', '', '61', '這一條開心的路線61', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(63, '臺北市到淡水62', '', '62', '這一條開心的路線62', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(64, '臺北市到淡水63', '', '63', '這一條開心的路線63', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(65, '臺北市到淡水64', '', '64', '這一條開心的路線64', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(66, '臺北市到淡水65', '', '65', '這一條開心的路線65', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(67, '臺北市到淡水66', '', '66', '這一條開心的路線66', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(68, '臺北市到淡水67', '', '67', '這一條開心的路線67', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(69, '臺北市到淡水68', '', '68', '這一條開心的路線68', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(70, '臺北市到淡水69', '', '69', '這一條開心的路線69', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(71, '臺北市到淡水70', '', '70', '這一條開心的路線70', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(72, '臺北市到淡水71', '', '71', '這一條開心的路線71', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(73, '臺北市到淡水72', '', '72', '這一條開心的路線72', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(74, '臺北市到淡水73', '', '73', '這一條開心的路線73', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(75, '臺北市到淡水74', '', '74', '這一條開心的路線74', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(76, '臺北市到淡水75', '', '75', '這一條開心的路線75', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(77, '臺北市到淡水76', '', '76', '這一條開心的路線76', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(78, '臺北市到淡水77', '', '77', '這一條開心的路線77', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(79, '臺北市到淡水78', '', '78', '這一條開心的路線78', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(80, '臺北市到淡水79', '', '79', '這一條開心的路線79', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(81, '臺北市到淡水80', '', '80', '這一條開心的路線80', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(82, '臺北市到淡水81', '', '81', '這一條開心的路線81', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(83, '臺北市到淡水82', '', '82', '這一條開心的路線82', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(84, '臺北市到淡水83', '', '83', '這一條開心的路線83', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(85, '臺北市到淡水84', '', '84', '這一條開心的路線84', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(86, '臺北市到淡水85', '', '85', '這一條開心的路線85', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(87, '臺北市到淡水86', '', '86', '這一條開心的路線86', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(88, '臺北市到淡水87', '', '87', '這一條開心的路線87', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(89, '臺北市到淡水88', '', '88', '這一條開心的路線88', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(90, '臺北市到淡水89', '', '89', '這一條開心的路線89', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(91, '臺北市到淡水90', '', '90', '這一條開心的路線90', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(92, '臺北市到淡水91', '', '91', '這一條開心的路線91', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(93, '臺北市到淡水92', '', '92', '這一條開心的路線92', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(94, '臺北市到淡水93', '', '93', '這一條開心的路線93', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(95, '臺北市到淡水94', '', '94', '這一條開心的路線94', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(96, '臺北市到淡水95', '', '95', '這一條開心的路線95', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(97, '臺北市到淡水96', '', '96', '這一條開心的路線96', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(98, '臺北市到淡水97', '', '97', '這一條開心的路線97', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(99, '臺北市到淡水98', '', '98', '這一條開心的路線98', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(100, '臺北市到淡水99', '', '99', '這一條開心的路線99', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(101, '臺北市到淡水100', '', '100', '這一條開心的路線100', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(102, '臺北市到淡水101', '', '101', '這一條開心的路線101', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(103, '臺北市到淡水102', '', '102', '這一條開心的路線102', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(104, '臺北市到淡水103', '', '103', '這一條開心的路線103', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(105, '臺北市到淡水104', '', '104', '這一條開心的路線104', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(106, '臺北市到淡水105', '', '105', '這一條開心的路線105', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(107, '臺北市到淡水106', '', '106', '這一條開心的路線106', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(108, '臺北市到淡水107', '', '107', '這一條開心的路線107', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(109, '臺北市到淡水108', '', '108', '這一條開心的路線108', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(110, '臺北市到淡水109', '', '109', '這一條開心的路線109', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(111, '臺北市到淡水110', '', '110', '這一條開心的路線110', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(112, '臺北市到淡水111', '', '111', '這一條開心的路線111', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(113, '臺北市到淡水112', '', '112', '這一條開心的路線112', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(114, '臺北市到淡水113', '', '113', '這一條開心的路線113', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(115, '臺北市到淡水114', '', '114', '這一條開心的路線114', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(116, '臺北市到淡水115', '', '115', '這一條開心的路線115', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(117, '臺北市到淡水116', '', '116', '這一條開心的路線116', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(118, '臺北市到淡水117', '', '117', '這一條開心的路線117', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(119, '臺北市到淡水118', '', '118', '這一條開心的路線118', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(120, '臺北市到淡水119', '', '119', '這一條開心的路線119', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(121, '臺北市到淡水120', '', '120', '這一條開心的路線120', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(122, '臺北市到淡水121', '', '121', '這一條開心的路線121', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(123, '臺北市到淡水122', '', '122', '這一條開心的路線122', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(124, '臺北市到淡水123', '', '123', '這一條開心的路線123', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(125, '臺北市到淡水124', '', '124', '這一條開心的路線124', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(126, '臺北市到淡水125', '', '125', '這一條開心的路線125', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(127, '臺北市到淡水126', '', '126', '這一條開心的路線126', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(128, '臺北市到淡水127', '', '127', '這一條開心的路線127', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(129, '臺北市到淡水128', '', '128', '這一條開心的路線128', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(130, '臺北市到淡水129', '', '129', '這一條開心的路線129', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(131, '臺北市到淡水130', '', '130', '這一條開心的路線130', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(132, '臺北市到淡水131', '', '131', '這一條開心的路線131', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(133, '臺北市到淡水132', '', '132', '這一條開心的路線132', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(134, '臺北市到淡水133', '', '133', '這一條開心的路線133', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(135, '臺北市到淡水134', '', '134', '這一條開心的路線134', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(136, '臺北市到淡水135', '', '135', '這一條開心的路線135', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(137, '臺北市到淡水136', '', '136', '這一條開心的路線136', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(138, '臺北市到淡水137', '', '137', '這一條開心的路線137', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(139, '臺北市到淡水138', '', '138', '這一條開心的路線138', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(140, '臺北市到淡水139', '', '139', '這一條開心的路線139', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(141, '臺北市到淡水140', '', '140', '這一條開心的路線140', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(142, '臺北市到淡水141', '', '141', '這一條開心的路線141', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(143, '臺北市到淡水142', '', '142', '這一條開心的路線142', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(144, '臺北市到淡水143', '', '143', '這一條開心的路線143', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(145, '臺北市到淡水144', '', '144', '這一條開心的路線144', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(146, '臺北市到淡水145', '', '145', '這一條開心的路線145', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(147, '臺北市到淡水146', '', '146', '這一條開心的路線146', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(148, '臺北市到淡水147', '', '147', '這一條開心的路線147', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(149, '臺北市到淡水148', '', '148', '這一條開心的路線148', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(150, '臺北市到淡水149', '', '149', '這一條開心的路線149', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(151, '臺北市到淡水150', '', '150', '這一條開心的路線150', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(152, '臺北市到淡水151', '', '151', '這一條開心的路線151', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(153, '臺北市到淡水152', '', '152', '這一條開心的路線152', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(154, '臺北市到淡水153', '', '153', '這一條開心的路線153', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(155, '臺北市到淡水154', '', '154', '這一條開心的路線154', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(156, '臺北市到淡水155', '', '155', '這一條開心的路線155', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(157, '臺北市到淡水156', '', '156', '這一條開心的路線156', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(158, '臺北市到淡水157', '', '157', '這一條開心的路線157', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(159, '臺北市到淡水158', '', '158', '這一條開心的路線158', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(160, '臺北市到淡水159', '', '159', '這一條開心的路線159', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(161, '臺北市到淡水160', '', '160', '這一條開心的路線160', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(162, '臺北市到淡水161', '', '161', '這一條開心的路線161', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(163, '臺北市到淡水162', '', '162', '這一條開心的路線162', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(164, '臺北市到淡水163', '', '163', '這一條開心的路線163', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(165, '臺北市到淡水164', '', '164', '這一條開心的路線164', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(166, '臺北市到淡水165', '', '165', '這一條開心的路線165', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(167, '臺北市到淡水166', '', '166', '這一條開心的路線166', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(168, '臺北市到淡水167', '', '167', '這一條開心的路線167', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(169, '臺北市到淡水168', '', '168', '這一條開心的路線168', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(170, '臺北市到淡水169', '', '169', '這一條開心的路線169', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(171, '臺北市到淡水170', '', '170', '這一條開心的路線170', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(172, '臺北市到淡水171', '', '171', '這一條開心的路線171', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(173, '臺北市到淡水172', '', '172', '這一條開心的路線172', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(174, '臺北市到淡水173', '', '173', '這一條開心的路線173', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(175, '臺北市到淡水174', '', '174', '這一條開心的路線174', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(176, '臺北市到淡水175', '', '175', '這一條開心的路線175', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(177, '臺北市到淡水176', '', '176', '這一條開心的路線176', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(178, '臺北市到淡水177', '', '177', '這一條開心的路線177', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(179, '臺北市到淡水178', '', '178', '這一條開心的路線178', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(180, '臺北市到淡水179', '', '179', '這一條開心的路線179', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(181, '臺北市到淡水180', '', '180', '這一條開心的路線180', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(182, '臺北市到淡水181', '', '181', '這一條開心的路線181', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(183, '臺北市到淡水182', '', '182', '這一條開心的路線182', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(184, '臺北市到淡水183', '', '183', '這一條開心的路線183', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(185, '臺北市到淡水184', '', '184', '這一條開心的路線184', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(186, '臺北市到淡水185', '', '185', '這一條開心的路線185', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(187, '臺北市到淡水186', '', '186', '這一條開心的路線186', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(188, '臺北市到淡水187', '', '187', '這一條開心的路線187', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(189, '臺北市到淡水188', '', '188', '這一條開心的路線188', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(190, '臺北市到淡水189', '', '189', '這一條開心的路線189', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(191, '臺北市到淡水190', '', '190', '這一條開心的路線190', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(192, '臺北市到淡水191', '', '191', '這一條開心的路線191', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(193, '臺北市到淡水192', '', '192', '這一條開心的路線192', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(194, '臺北市到淡水193', '', '193', '這一條開心的路線193', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(195, '臺北市到淡水194', '', '194', '這一條開心的路線194', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(196, '臺北市到淡水195', '', '195', '這一條開心的路線195', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(197, '臺北市到淡水196', '', '196', '這一條開心的路線196', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(198, '臺北市到淡水197', '', '197', '這一條開心的路線197', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(199, '臺北市到淡水198', '', '198', '這一條開心的路線198', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(200, '臺北市到淡水199', '', '199', '這一條開心的路線199', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街'),
(201, '臺北市到淡水200', '', '200', '這一條開心的路線200', '00:00:00', 'Day-trip', 'Taiwan', '台北', '台北車站', '淡水老街');

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `course`
--
ALTER TABLE `course`
  ADD UNIQUE KEY `c_sid` (`c_sid`);

--
-- 資料表索引 `e_list`
--
ALTER TABLE `e_list`
  ADD PRIMARY KEY (`e_sid`);

--
-- 資料表索引 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`m_sid`),
  ADD UNIQUE KEY `m_email` (`m_email`);

--
-- 資料表索引 `prouduct`
--
ALTER TABLE `prouduct`
  ADD PRIMARY KEY (`p_sid`);

--
-- 資料表索引 `route`
--
ALTER TABLE `route`
  ADD PRIMARY KEY (`r_sid`);

--
-- 在匯出的資料表使用 AUTO_INCREMENT
--

--
-- 使用資料表 AUTO_INCREMENT `course`
--
ALTER TABLE `course`
  MODIFY `c_sid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表 AUTO_INCREMENT `e_list`
--
ALTER TABLE `e_list`
  MODIFY `e_sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- 使用資料表 AUTO_INCREMENT `member`
--
ALTER TABLE `member`
  MODIFY `m_sid` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表 AUTO_INCREMENT `prouduct`
--
ALTER TABLE `prouduct`
  MODIFY `p_sid` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品流水號', AUTO_INCREMENT=35;

--
-- 使用資料表 AUTO_INCREMENT `route`
--
ALTER TABLE `route`
  MODIFY `r_sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=202;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
